Bartosz-Woj/Mobile_robot_hardware_platform_STM32/software/initial configuration/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KILL_PIN_Pin GPIO_PIN_13
#define KILL_PIN_GPIO_Port GPIOC
#define IR_Pin GPIO_PIN_14
#define IR_GPIO_Port GPIOC
#define STATUS_LED1_Pin GPIO_PIN_15
#define STATUS_LED1_GPIO_Port GPIOC
#define LED_SENSOR_PWM_Pin GPIO_PIN_6
#define LED_SENSOR_PWM_GPIO_Port GPIOA
#define STATUS_LED3_Pin GPIO_PIN_7
#define STATUS_LED3_GPIO_Port GPIOA
#define STATUS_LED2_Pin GPIO_PIN_4
#define STATUS_LED2_GPIO_Port GPIOC
#define V_VHK_Pin GPIO_PIN_2
#define V_VHK_GPIO_Port GPIOB
#define Servo1_Pin GPIO_PIN_14
#define Servo1_GPIO_Port GPIOB
#define Servo2_Pin GPIO_PIN_15
#define Servo2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
